<pad>
<unk>
<bos>
<eos>
.
,
the
a
and
of
is
to
's
it
in
that
as
for
this
but
with
an
be
film
its
you
...
movie
n't
i
are
than
more
on
his
--
not
one
so
too
at
can
characters
good
have
little
all
by
has
'
or
who
if
out
there
they
've
-lrb-
-rrb-
about
best
do
from
like
may
over
work
`
better
how
just
most
story
up
when
again
any
bad
could
does
even
makes
never
no
nothing
should
them
these
which
''
almost
come
director
he
into
much
only
performance
seems
seen
something
us
very
want
was
we
well
what
while
will
world
would
-
``
action
character
end
fascinating
films
funny
history
life
plot
really
right
stuff
thriller
time
why
young
your
!
;
actually
audiences
between
both
comedy
comes
done
down
drama
feels
filmmakers
find
hard
her
itself
know
love
many
might
music
new
offers
old
once
proves
quite
some
still
tap
their
those
way
were
women
'll
'm
're
:
?
also
away
because
been
bit
carries
cast
clever
comic
convincing
creative
did
documentary
dying
effort
emotional
enough
every
eye
familiar
feel
filmmaker
filmmaking
first
french
fun
gets
going
gorgeous
high
horror
hour
idea
imax
impressive
jackson
last
less
light
long
look
made
make
making
man
metaphor
modern-day
movies
mr.
nice
off
original
picture
piece
pieces
place
playing
pleasure
rich
role
sad
script
she
special
spider-man
stunning
successful
such
surprising
takes
though
through
two
video
war
watch
where
wo
working
year
years
13
absolutely
acting
along
always
ambitious
american
animated
another
anything
apollo
apparently
art
astonishing
atmosphere
b
bartleby
before
big
bland
brain
burger
ca
care
casting
celebration
cheap
chilling
cho
chris
cinema
classic
color
comfort
completely
complex
contrived
convinced
cultural
dark
deeply
definitely
deliver
delivers
depth
desperately
despite
dialogue
direction
disney
diverting
doing
downtown
easy
either
enhances
entertain
entertaining
entertainment
ever
everything
experience
family
fare
feature
felt
female
few
finally
fire
flat
format
frank
full
get
goes
great
grows
hand
heaven
help
heroine
himself
holds
home
however
huppert
inexperienced
insane
insight
intrigue
junk
justice
keep
kids
kind
knowledge
latest
leads
left
line
lines
live
lives
looking
manages
material
matter
me
measured
memory
middle
minutes
modest
moment
motion
moving
ms.
my
near
novel
nowhere
occasionally
often
parade
past
performances
person
personal
play
please
priceless
probably
project
prove
psychological
rarely
real
recent
released
remarkable
return
ride
said
same
say
screen
screenplay
see
sense
sensibilities
sequences
series
serves
set
shows
silly
simply
since
sit
situation
situations
slow
steven
stirring
strangely
strong
study
succeed
succeeds
superb
take
taking
tale
tell
thing
thought
told
tone
touch
treatment
truly
tv
understand
understated
unexpected
unpredictable
unsettling
used
usual
viewers
vivid
wants
watchable
watching
within
without
woman
worst
worth
!?
$
'60s
'70s
10
101
1930s
1987
19th-century
2
2-day
25
90
99
\/
abandon
abel
able
ably
above
absurd
absurdity
accessibility
accidental
achievement
achingly
across
act
actor
actorliness
actors
adam
adaptation
addictive
adequate
admirably
admirers
adobo
adolescent
adult
adults
advantage
after
age
agency
ages
agitator
ai
aimlessly
alan
alert
alive
allen
although
amazing
ambivalence
amiable
amish
amnesiac
among
amuse
ana
angle
animation
anna
anomie
answer
answers
apartheid
approaches
ararat
around
arthouse
as-it
as-nasty
asia
ask
assassin
assassins
assembled
astounding
astray
attending
attraction
audience
awakens
awe
awful
awkward
b\u00e9art
baby-faced
back
bag
baggage
bai
ballot
band
barely
bargain-basement
barry
based
be-all-end-all
beast
beaten
beautiful
beauty
become
becomes
being
believable
believe
benigni
bergmanesque
berling
besson
big-screen
birthday
bisset
black-and-white
blade
blank
blender
blind
bloated
blow
blue
bluster
bodacious
body
boffo
bogdanovich
bond
bone
book
boosted
boss
bothers
bottomlessly
boy
brand
bratty
braveheart
break
breath
breitbart
brent
bring
bringing
british
brothers
budget
bug-eyed
bullets
bullock
bunch
burdened
buy
caf\u00e9
caine
cake
cal
calibrated
callar
calories
campanella
candles
candor
canned
caper
capra
captivating
captures
career
career-defining
carrying
cartoon
case
cassavetes
cat-and-mouse
catches
cathartic
caught
celluloid
chabrol
challenging
chan
change
changes
charm
chasing
chaykin
chefs
chelsea
chest
child
children
chin
china
choke
choose
chronicle
cia
clause
clear
clear-eyed
cleavage
cletis
clich\u00e9s
clients
cliffhanger
clockstoppers
close
closed
clothes
clubs
clumsily
co-writer
coal
coke
cold
collinwood
colorful
comedies
comedy\/drama
comfortable
commerce
common
company
compelling
compellingly
competence
complicated
composure
conduct
conflicts
confront
congratulate
connected
connoisseurs
consistent
conspiracies
constraints
construct
contradicts
controlling
conventional
conviction
convoluted
cooper
cop
core
count
courtship
cow
crackle
crackles
crane
crawling
crazy
creating
creepy
crew
crimes
criminal
crippled
cross
crude
crush
cub
cuban
cult
cultures
curiosity
cutting
cutting-room
cynical
dad
damn
damon\/bourne
dancing
dangerous
darkness
davies
day
daytime
dazzling
de
dead
death
death-defying
debt
debut
decent
decide
decline
deeds
degree
delicate
delightful
demi
demons
dense
depiction
derailed
destruction
determined
devotees
diapers
diary
die
die-hard
difficult
digital
dimensions
diplomacy
directly
directorial
directors
dirty
disappointed
discipline
discloses
disguise
display
ditsy
document
dog
dognini
doubt
downplaying
drag
dragons
dramatically
dramatized
drang
dream
dreary
driver
drop
drumline
duck
dunst
dust
e-graveyard
earnest
earth
easier
easily
edge
edgy
eerily
effects
effortlessly
efforts
eh
elements
elevates
eloquent
else
emerge
emotionally
empathy
empire
encounter
encouraging
ending
endless
endlessly
enduring
energy
engaging
engagingly
engrossing
enigmatic
enjoy
enjoying
enormous
entertainingly
enthusiasms
entire
epic
era
escort
especially
essentially
established
european
events
eventually
everywhere
evil
exactly
examines
exceeding
excels
excites
exciting
executed
execution
exhilarating
existentialism
expect
expectations
expects
experiment
exploitation
exploitative
exposition
extraordinarily
extreme
facts
failure
fairly
fake
falls
fan
fanciful
fans
fascination
fashion
fast
fast-paced
fat
fatal
feeling
feisty
ferrara
fest
fewer
field
fighting
final
finale
fine
finish
first-rate
fit
five
fizz
flame
flick
flip-flop
floor
fly
followed
follows
fondly
food
force
foreground
forest
form
formula
forty
founding
fragmented
free
freedom
freeman
fresh
fret
friendship
frightful
fuhrman
fun-seeking
funniest
fussing
futuristic
gags
gallo
gang
gave
gay
geeked
general
generic
generosity
genial
genre
gentle
gently
george
gibson
giddy
girl
girl-meets-girl
give
given
gives
golf
gooding
goofiest
gory
got
gourd
government
grandeur
greater
greatly
greek
greenfingers
grew
grin
grisly
grooved
growth
guilt-trip
guilty
guts
gutsy
guys
had
hairs
half
halloween
handle
hanley
hanussen
happy
harbor
hard-edged
hardly
hardware
hart
hate
having
hazy
headly
heard
heart
heart-warming
heavy
helm
hews
hideously
highly
hilarious
holiday
hollow
hollywood
homicide
honest
honesty
hoped
hopeful
hoping
hotel
howard
human
humor
hypothesis
ichi
iconoclastic
ideas
identity
ill-conceived
ill-wrought
imagination
imaginative
immediacy
important
incapable
incinerates
incorporate
indicative
indulgence
indulgent
inescapably
inexplicably
influenced
ingenious
ingratiating
insightful
inspiration
inspired
instead
instinct
institution
instruct
insufficiently
insult
integrating
intellectual
intelligence
intense
intensity
intentions
interest
interested
interesting
intimate
invincible
involved
iq
irrelevant
irrepressible
irvine
irwins
isabelle
issues
j.
jagger
jane
jason
jaunt
jaw-dropping
job
joff\u00e9
joke
jokes
jolted
jonathan
journey
joyful
joyous
judd
kang
keeping
keeps
kicking
kid
kidlets
kidman
kilt
kilted
kinda
kinnear
kirsten
kozmo
lacking
lacks
land
landscape
lane
language
late-twenty-somethings
lead
learn
leash
least
leigh
leonard
lesson
letter
level
liana
liberties
libertine
library
license
lifeless
likes
lioness
little-remembered
living
lodging
lonely
longer
longest
looks
lopez
lost
lots
lousy
lovely
loving
low
low-budget
lucas
lucia
lucid
lumpy
lurid
lush
lyrical
maggots
magical
magnificent
mainstream
majestic
makers
male
manipulation
mankind
manual
marching
margarita
marginal
marine\/legal
mark
markers
markets
marks
martin
master
masterfully
match
maze
meeting
mehta
melodrama
mendes
mess
methodical
mick
mika
mile
milk
mind
minutiae
miramax
misery
mishmash
missing
mixed-up
modern
modern-office
moldy-oldie
moments
monologue
monsters
mood
moody
moore
morally
morvern
mostly
mouglalis
move
moviegoing
must
mysteries
mystery
name
natter
naughty
nearly
necessarily
neck
need
needs
needy
negligible
neil
neither
nerve-raked
nerves
nettelbeck
neutral
nevertheless
nicely
nicholson
nick
nicole
night
nolan
nonjudgmental
nor
not-nearly
notion
now
nowadays
numbered
obvious
offbeat
oh
old-hat
one-of-a-kind
ones
onto
oozing
opened
opening
opens
organic
otto-sallies
ou
out-of-kilter
outer
outrageously
overall
overcomes
overhearing
oversexed
overwrought
owed
packages
palate
palette
panic
parachutes
paradigm
parents
park
parker
particular
partly
partner
party
passion
passionate
pastiche
path
pathetic
patience
patient
paws
paxton
pays
pearl
pedestrian
people
perfectly
performers
perhaps
period
permitting
perpetually
perspective
pertinent
perverse
photographed
pic
picaresque
picture-perfect
pictures
pillages
piscopo
places
placing
plays
pleasant
plotline
plotted
poetic
poetry
poignant
popcorn
porridge
possibilities
post-war
posthumously
precious
predecessor
predecessors
predicament
predictable
premise
preordained
presented
presiding
presume
pretension
prettiest
pretty
prevents
primal
principled
proceedings
process
produce
prostitute
protecting
province
psychedelia
psychedelic
psychodrama
published
pull
punch
punk
pure
purposefully
put
puts
quality
quest
question
questionable
quick
quiet
quixotic
r
racial
radiant
raimi
rambles
ramsay
ranges
rapes
rare
rat
rate
rather
raw
raymond
re-imagining
re-release
reason
reassembled
reassuring
recall
recipe
recommend
reduces
reductive
reeking
reel
rehash
reign
relating
relationships
releasing
reliable
relieved
reluctant
remade
remake
remembered
remind
reminder
renner
reno
repeatedly
represented
repugnant
rerun
reruns
research
resident
resourceful
respect
resurrection
revelation
reworking
right-thinking
rigidly
rigor
ring
rip-roaring
rises
riveting
robust
rock
rogue
roland
rollicking
romance
romances
romantic
ron
room
rough-around-the-edges
routine
royals
rumblings
rumination
run
run-of-the-mill
runner
running
rush
russian
sade
safe
sandler
sandra
santa
sappy
satirical
satisfies
satisfying
save
savour
sayles
scandals
scarlet
scary
scattered
scene-chewing
scenes
scherfig
schrader
sci-fi
science-fiction
scooby-doo
scorsese
screenwriter
seagal
searching
season
seat
second
secret
seek
seem
sees
self-discovery
sentimental
sequel
serenity
serious
service
sex
shadows
shake
shakespeare
shaky
sham
shamefully
sharing
sharp
shatner
she-cute
shocker
short
shoulder
show
showcases
shower
shu
side
sight
sincere
singing
single
singles
sinister
sitting
size
skills
skimpy
skinny
skyscraper-trapeze
slash-fest
sleight-of-hand
slice
slick
slightly
sluggish
small
smaller
smarter
smoochy
smug
soap
sociology
soderbergh
soldiers
solemn
solid
solo
somber
sometimes
somewhat
sophomoric
sorvino
sound
sounds
space
sparks
spectacular
spice
spielberg
spirit
splendid-looking
sports
spring
sprinkled
spy
square
staged
stagings
standard
stars
start
static
step
stereotypes
sticks
stiff
stockings
stomach-turning
stop
stories
storytelling
strands
streamlined
street-smart
stretches
strictly
strike
strikes
striking
strolls
studio-produced
stunts
stupid
sturm
style
stylish
subliminally
substance
substitute
subtler
sucking
suffers
suit
suitcase
summer
summery
sunbaked
sunk
superbly
superman
suppose
surprise
surprisingly
surreal
surrendering
suspect
suspended
suspense
sustain
swear
sweat
sweet
swinging
swords
symbolism
sympathy
tables
tackles
taken
talent
talks
tapestry
tapping
taste
taut
team
tearjerker
technological
technology
tedious
tedium
teens
teeth-gnashing
televised
tells
ten
tenacious
tension
terms
text
theaters
themselves
theory
things
thinks-it-is
thoughtlessly
three
thrill
thrives
throws
tickles
times
timing
toss-up
total
touches
tough
tour
tout
traditionally
tragically
trainspotting
translation
transporter
transporting
trappings
traveler
treat
treated
treats
trees
triumph
trot
troubled
truck
true
try
turn
turned
turns
tuxedo
twisting
two-day
typical
ugly-duckling
un-bear-able
unblinking
uncertain
uncompromising
unconventional
und
understanding
undoubtedly
unerring
unexamined
unexpectedly
unfolds
unforgettable
unfortunate
unfortunately
unimaginable
uninitiated
unseemly
unstoppable
update
uphill
uplifting
urban
uses
ut
vanity
verdict
via
view
viewer
viewing
villain
villains
vincent
violent
visit
visually
wallace
wallop
walls
warner
wasted
water
waterboy
waydowntown
weak
wearing
wedding
weirdly
weirdo
welcome
well-balanced
well-intentioned
well-worn
welsh
went
whenever
whole
whom
wind
winning
wishing
wit
wonderful
wonderfully
woodman
word
words
works
worthy
woven
wow
wretched
written
wrote
x
xmas
yank
yard
yes
yong
you-are-there